[Killed] BlockStatement
DockHdd/workspace/mutant/index.js:1:34
-function calculator(method, a, b){
-    let result;
-
-    switch(method){
-        case "add":
-            result = a + b;
-            break;
-        case "sub":
-            result = a - b;
-            break;
-    }
-    return result;
-}
+function calculator(method, a, b){}
 
 module.exports = {
killedBy: calculator Add
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Survived] ConditionalExpression
DockHdd/workspace/mutant/index.js:5:9
     let result;
 
     switch(method){
-        case "add":
-            result = a + b;
-            break;
+        case "add":
         case "sub":
             result = a - b;

[Survived] ArithmeticOperator
DockHdd/workspace/mutant/index.js:6:22
 
     switch(method){
         case "add":
-            result = a + b;
+            result = a - b;
             break;
         case "sub":

[Killed] ConditionalExpression
DockHdd/workspace/mutant/index.js:8:9
         case "add":
             result = a + b;
             break;
-        case "sub":
-            result = a - b;
-            break;
+        case "sub":
     }
     return result;
killedBy: calculator Sub
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: undefined

[Killed] ArithmeticOperator
DockHdd/workspace/mutant/index.js:9:22
             result = a + b;
             break;
         case "sub":
-            result = a - b;
+            result = a + b;
             break;
     }
killedBy: calculator Sub
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: 3
